claydonkey/openblt/Target/Source/ARMCM7_STM32H7/flash.c
/****************************************************************************************
* Local constant declarations
****************************************************************************************/
/** \brief   If desired, it is possible to set BOOT_FLASH_CUSTOM_LAYOUT_ENABLE to > 0
 *           in blt_conf.h and then implement your own version of the flashLayout[] table
 *           in a source-file with the name flash_layout.c. This way you customize the
 *           flash memory size reserved for the bootloader, without having to modify
 *           the flashLayout[] table in this file directly. This file will then include
 *           flash_layout.c so there is no need to compile it additionally with your
 *           project.
 */
#if (BOOT_FLASH_CUSTOM_LAYOUT_ENABLE == 0)
/** \brief   Array wit the layout of the flash memory.
 *  \details Also controls what part of the flash memory is reserved for the bootloader.
 *           If the bootloader size changes, the reserved sectors for the bootloader
 *           might need adjustment to make sure the bootloader doesn't get overwritten.
 */
static const tFlashSector flashLayout[] =
{
#if (BOOT_NVM_SIZE_KB < 1024)
  #error "BOOT_NVM_SIZE_KB < 1024 is currently not supported."
#elif (BOOT_NVM_SIZE_KB == 1024)
    /* { 0x08000000, 0x20000, 0, 1 },     flash sector idx 0 - reserved for bootloader */
    { 0x08020000, 0x20000, 1, 1},        /* flash sector idx  1 - 128kb                */
    { 0x08040000, 0x20000, 2, 1},        /* flash sector idx  2 - 128kb                */
    { 0x08060000, 0x20000, 3, 1},        /* flash sector idx  3 - 128kb                */
    /* Note that there is a gap here. */
    { 0x08100000, 0x20000, 0, 2},        /* flash sector idx  4 - 128kb                */
    { 0x08120000, 0x20000, 1, 2},        /* flash sector idx  5 - 128kb                */
    { 0x08140000, 0x20000, 2, 2},        /* flash sector idx  6 - 128kb                */
    { 0x08160000, 0x20000, 3, 2},        /* flash sector idx  7 - 128kb                */
#elif (BOOT_NVM_SIZE_KB == 2048)
#if defined(STM32H7A3xx) || defined(STM32H7B3xx) || defined(STM32H7B0xx) || defined(STM32H7A3xxQ) || defined(STM32H7B3xxQ) || defined(STM32H7B0xxQ)
//	{0x08000000,0x2000,0,1},         /* flash sector idx 0 - 8kb     - reserved for bootloader    */
//	{0x08002000,0x2000,1,1},         /* flash sector idx 1 - 8kb     - reserved for bootloader    */
//	{0x08004000,0x2000,2,1},         /* flash sector idx 2 - 8kb     - reserved for bootloader    */
//	{0x08006000,0x2000,3,1},         /* flash sector idx 3 - 8kb     - reserved for bootloader    */
//	{0x08008000,0x2000,4,1},         /* flash sector idx 4 - 8kb         */
//	{0x0800A000,0x2000,5,1},         /* flash sector idx 5 - 8kb         */
//	{0x0800C000,0x2000,6,1},         /* flash sector idx 6 - 8kb         */
//	{0x0800E000,0x2000,7,1},         /* flash sector idx 7 - 8kb         */
	{0x08010000,0x2000,8,1},         /* flash sector idx 8 - 8kb         */
	{0x08012000,0x2000,9,1},         /* flash sector idx 9 - 8kb         */
	{0x08014000,0x2000,10,1},        /* flash sector idx 10 - 8kb        */
	{0x08016000,0x2000,11,1},        /* flash sector idx 11 - 8kb        */
	{0x08018000,0x2000,12,1},        /* flash sector idx 12 - 8kb        */
	{0x0801A000,0x2000,13,1},        /* flash sector idx 13 - 8kb        */
	{0x0801C000,0x2000,14,1},        /* flash sector idx 14 - 8kb        */
	{0x0801E000,0x2000,15,1},        /* flash sector idx 15 - 8kb        */
	{0x08020000,0x2000,16,1},        /* flash sector idx 16 - 8kb        */
	{0x08022000,0x2000,17,1},        /* flash sector idx 17 - 8kb        */
	{0x08024000,0x2000,18,1},        /* flash sector idx 18 - 8kb        */
	{0x08026000,0x2000,19,1},        /* flash sector idx 19 - 8kb        */
	{0x08028000,0x2000,20,1},        /* flash sector idx 20 - 8kb        */
	{0x0802A000,0x2000,21,1},        /* flash sector idx 21 - 8kb        */
	{0x0802C000,0x2000,22,1},        /* flash sector idx 22 - 8kb        */
	{0x0802E000,0x2000,23,1},        /* flash sector idx 23 - 8kb        */
	{0x08030000,0x2000,24,1},        /* flash sector idx 24 - 8kb        */
	{0x08032000,0x2000,25,1},        /* flash sector idx 25 - 8kb        */
	{0x08034000,0x2000,26,1},        /* flash sector idx 26 - 8kb        */
	{0x08036000,0x2000,27,1},        /* flash sector idx 27 - 8kb        */
	{0x08038000,0x2000,28,1},        /* flash sector idx 28 - 8kb        */
	{0x0803A000,0x2000,29,1},        /* flash sector idx 29 - 8kb        */
	{0x0803C000,0x2000,30,1},        /* flash sector idx 30 - 8kb        */
	{0x0803E000,0x2000,31,1},        /* flash sector idx 31 - 8kb        */
	{0x08040000,0x2000,32,1},        /* flash sector idx 32 - 8kb        */
	{0x08042000,0x2000,33,1},        /* flash sector idx 33 - 8kb        */
	{0x08044000,0x2000,34,1},        /* flash sector idx 34 - 8kb        */
	{0x08046000,0x2000,35,1},        /* flash sector idx 35 - 8kb        */
	{0x08048000,0x2000,36,1},        /* flash sector idx 36 - 8kb        */
	{0x0804A000,0x2000,37,1},        /* flash sector idx 37 - 8kb        */
	{0x0804C000,0x2000,38,1},        /* flash sector idx 38 - 8kb        */
	{0x0804E000,0x2000,39,1},        /* flash sector idx 39 - 8kb        */
	{0x08050000,0x2000,40,1},        /* flash sector idx 40 - 8kb        */
	{0x08052000,0x2000,41,1},        /* flash sector idx 41 - 8kb        */
	{0x08054000,0x2000,42,1},        /* flash sector idx 42 - 8kb        */
	{0x08056000,0x2000,43,1},        /* flash sector idx 43 - 8kb        */
	{0x08058000,0x2000,44,1},        /* flash sector idx 44 - 8kb        */
	{0x0805A000,0x2000,45,1},        /* flash sector idx 45 - 8kb        */
	{0x0805C000,0x2000,46,1},        /* flash sector idx 46 - 8kb        */
	{0x0805E000,0x2000,47,1},        /* flash sector idx 47 - 8kb        */
	{0x08060000,0x2000,48,1},        /* flash sector idx 48 - 8kb        */
	{0x08062000,0x2000,49,1},        /* flash sector idx 49 - 8kb        */
	{0x08064000,0x2000,50,1},        /* flash sector idx 50 - 8kb        */
	{0x08066000,0x2000,51,1},        /* flash sector idx 51 - 8kb        */
	{0x08068000,0x2000,52,1},        /* flash sector idx 52 - 8kb        */
	{0x0806A000,0x2000,53,1},        /* flash sector idx 53 - 8kb        */
	{0x0806C000,0x2000,54,1},        /* flash sector idx 54 - 8kb        */
	{0x0806E000,0x2000,55,1},        /* flash sector idx 55 - 8kb        */
	{0x08070000,0x2000,56,1},        /* flash sector idx 56 - 8kb        */
	{0x08072000,0x2000,57,1},        /* flash sector idx 57 - 8kb        */
	{0x08074000,0x2000,58,1},        /* flash sector idx 58 - 8kb        */
	{0x08076000,0x2000,59,1},        /* flash sector idx 59 - 8kb        */
	{0x08078000,0x2000,60,1},        /* flash sector idx 60 - 8kb        */
	{0x0807A000,0x2000,61,1},        /* flash sector idx 61 - 8kb        */
	{0x0807C000,0x2000,62,1},        /* flash sector idx 62 - 8kb        */
	{0x0807E000,0x2000,63,1},        /* flash sector idx 63 - 8kb        */
	{0x08080000,0x2000,64,1},        /* flash sector idx 64 - 8kb        */
	{0x08082000,0x2000,65,1},        /* flash sector idx 65 - 8kb        */
	{0x08084000,0x2000,66,1},        /* flash sector idx 66 - 8kb        */
	{0x08086000,0x2000,67,1},        /* flash sector idx 67 - 8kb        */
	{0x08088000,0x2000,68,1},        /* flash sector idx 68 - 8kb        */
	{0x0808A000,0x2000,69,1},        /* flash sector idx 69 - 8kb        */
	{0x0808C000,0x2000,70,1},        /* flash sector idx 70 - 8kb        */
	{0x0808E000,0x2000,71,1},        /* flash sector idx 71 - 8kb        */
	{0x08090000,0x2000,72,1},        /* flash sector idx 72 - 8kb        */
	{0x08092000,0x2000,73,1},        /* flash sector idx 73 - 8kb        */
	{0x08094000,0x2000,74,1},        /* flash sector idx 74 - 8kb        */
	{0x08096000,0x2000,75,1},        /* flash sector idx 75 - 8kb        */
	{0x08098000,0x2000,76,1},        /* flash sector idx 76 - 8kb        */
	{0x0809A000,0x2000,77,1},        /* flash sector idx 77 - 8kb        */
	{0x0809C000,0x2000,78,1},        /* flash sector idx 78 - 8kb        */
	{0x0809E000,0x2000,79,1},        /* flash sector idx 79 - 8kb        */
	{0x080A0000,0x2000,80,1},        /* flash sector idx 80 - 8kb        */
	{0x080A2000,0x2000,81,1},        /* flash sector idx 81 - 8kb        */
	{0x080A4000,0x2000,82,1},        /* flash sector idx 82 - 8kb        */
	{0x080A6000,0x2000,83,1},        /* flash sector idx 83 - 8kb        */
	{0x080A8000,0x2000,84,1},        /* flash sector idx 84 - 8kb        */
	{0x080AA000,0x2000,85,1},        /* flash sector idx 85 - 8kb        */
	{0x080AC000,0x2000,86,1},        /* flash sector idx 86 - 8kb        */
	{0x080AE000,0x2000,87,1},        /* flash sector idx 87 - 8kb        */
	{0x080B0000,0x2000,88,1},        /* flash sector idx 88 - 8kb        */
	{0x080B2000,0x2000,89,1},        /* flash sector idx 89 - 8kb        */
	{0x080B4000,0x2000,90,1},        /* flash sector idx 90 - 8kb        */
	{0x080B6000,0x2000,91,1},        /* flash sector idx 91 - 8kb        */
	{0x080B8000,0x2000,92,1},        /* flash sector idx 92 - 8kb        */
	{0x080BA000,0x2000,93,1},        /* flash sector idx 93 - 8kb        */
	{0x080BC000,0x2000,94,1},        /* flash sector idx 94 - 8kb        */
	{0x080BE000,0x2000,95,1},        /* flash sector idx 95 - 8kb        */
	{0x080C0000,0x2000,96,1},        /* flash sector idx 96 - 8kb        */
	{0x080C2000,0x2000,97,1},        /* flash sector idx 97 - 8kb        */
	{0x080C4000,0x2000,98,1},        /* flash sector idx 98 - 8kb        */
	{0x080C6000,0x2000,99,1},        /* flash sector idx 99 - 8kb        */
	{0x080C8000,0x2000,100,1},        /* flash sector idx 100 - 8kb        */
	{0x080CA000,0x2000,101,1},        /* flash sector idx 101 - 8kb        */
	{0x080CC000,0x2000,102,1},        /* flash sector idx 102 - 8kb        */
	{0x080CE000,0x2000,103,1},        /* flash sector idx 103 - 8kb        */
	{0x080D0000,0x2000,104,1},        /* flash sector idx 104 - 8kb        */
	{0x080D2000,0x2000,105,1},        /* flash sector idx 105 - 8kb        */
	{0x080D4000,0x2000,106,1},        /* flash sector idx 106 - 8kb        */
	{0x080D6000,0x2000,107,1},        /* flash sector idx 107 - 8kb        */
	{0x080D8000,0x2000,108,1},        /* flash sector idx 108 - 8kb        */
	{0x080DA000,0x2000,109,1},        /* flash sector idx 109 - 8kb        */
	{0x080DC000,0x2000,110,1},        /* flash sector idx 110 - 8kb        */
	{0x080DE000,0x2000,111,1},        /* flash sector idx 111 - 8kb        */
	{0x080E0000,0x2000,112,1},        /* flash sector idx 112 - 8kb        */
	{0x080E2000,0x2000,113,1},        /* flash sector idx 113 - 8kb        */
	{0x080E4000,0x2000,114,1},        /* flash sector idx 114 - 8kb        */
	{0x080E6000,0x2000,115,1},        /* flash sector idx 115 - 8kb        */
	{0x080E8000,0x2000,116,1},        /* flash sector idx 116 - 8kb        */
	{0x080EA000,0x2000,117,1},        /* flash sector idx 117 - 8kb        */
	{0x080EC000,0x2000,118,1},        /* flash sector idx 118 - 8kb        */
	{0x080EE000,0x2000,119,1},        /* flash sector idx 119 - 8kb        */
	{0x080F0000,0x2000,120,1},        /* flash sector idx 120 - 8kb        */
	{0x080F2000,0x2000,121,1},        /* flash sector idx 121 - 8kb        */
	{0x080F4000,0x2000,122,1},        /* flash sector idx 122 - 8kb        */
	{0x080F6000,0x2000,123,1},        /* flash sector idx 123 - 8kb        */
	{0x080F8000,0x2000,124,1},        /* flash sector idx 124 - 8kb        */
	{0x080FA000,0x2000,125,1},        /* flash sector idx 125 - 8kb        */
	{0x080FC000,0x2000,126,1},        /* flash sector idx 126 - 8kb        */
	{0x080FE000,0x2000,127,1},        /* flash sector idx 127 - 8kb        */
	{0x08100000,0x2000,0,2},        /* flash sector idx 0 - 8kb        */
	{0x08102000,0x2000,1,2},        /* flash sector idx 1 - 8kb        */
	{0x08104000,0x2000,2,2},        /* flash sector idx 2 - 8kb        */
	{0x08106000,0x2000,3,2},        /* flash sector idx 3 - 8kb        */
	{0x08108000,0x2000,4,2},        /* flash sector idx 4 - 8kb        */
	{0x0810A000,0x2000,5,2},        /* flash sector idx 5 - 8kb        */
	{0x0810C000,0x2000,6,2},        /* flash sector idx 6 - 8kb        */
	{0x0810E000,0x2000,7,2},        /* flash sector idx 7 - 8kb        */
	{0x08110000,0x2000,8,2},        /* flash sector idx 8 - 8kb        */
	{0x08112000,0x2000,9,2},        /* flash sector idx 9 - 8kb        */
	{0x08114000,0x2000,10,2},        /* flash sector idx 10 - 8kb        */
	{0x08116000,0x2000,11,2},        /* flash sector idx 11 - 8kb        */
	{0x08118000,0x2000,12,2},        /* flash sector idx 12 - 8kb        */
	{0x0811A000,0x2000,13,2},        /* flash sector idx 13 - 8kb        */
	{0x0811C000,0x2000,14,2},        /* flash sector idx 14 - 8kb        */
	{0x0811E000,0x2000,15,2},        /* flash sector idx 15 - 8kb        */
	{0x08120000,0x2000,16,2},        /* flash sector idx 16 - 8kb        */
	{0x08122000,0x2000,17,2},        /* flash sector idx 17 - 8kb        */
	{0x08124000,0x2000,18,2},        /* flash sector idx 18 - 8kb        */
	{0x08126000,0x2000,19,2},        /* flash sector idx 19 - 8kb        */
	{0x08128000,0x2000,20,2},        /* flash sector idx 20 - 8kb        */
	{0x0812A000,0x2000,21,2},        /* flash sector idx 21 - 8kb        */
	{0x0812C000,0x2000,22,2},        /* flash sector idx 22 - 8kb        */
	{0x0812E000,0x2000,23,2},        /* flash sector idx 23 - 8kb        */
	{0x08130000,0x2000,24,2},        /* flash sector idx 24 - 8kb        */
	{0x08132000,0x2000,25,2},        /* flash sector idx 25 - 8kb        */
	{0x08134000,0x2000,26,2},        /* flash sector idx 26 - 8kb        */
	{0x08136000,0x2000,27,2},        /* flash sector idx 27 - 8kb        */
	{0x08138000,0x2000,28,2},        /* flash sector idx 28 - 8kb        */
	{0x0813A000,0x2000,29,2},        /* flash sector idx 29 - 8kb        */
	{0x0813C000,0x2000,30,2},        /* flash sector idx 30 - 8kb        */
	{0x0813E000,0x2000,31,2},        /* flash sector idx 31 - 8kb        */
	{0x08140000,0x2000,32,2},        /* flash sector idx 32 - 8kb        */
	{0x08142000,0x2000,33,2},        /* flash sector idx 33 - 8kb        */
	{0x08144000,0x2000,34,2},        /* flash sector idx 34 - 8kb        */
	{0x08146000,0x2000,35,2},        /* flash sector idx 35 - 8kb        */
	{0x08148000,0x2000,36,2},        /* flash sector idx 36 - 8kb        */
	{0x0814A000,0x2000,37,2},        /* flash sector idx 37 - 8kb        */
	{0x0814C000,0x2000,38,2},        /* flash sector idx 38 - 8kb        */
	{0x0814E000,0x2000,39,2},        /* flash sector idx 39 - 8kb        */
	{0x08150000,0x2000,40,2},        /* flash sector idx 40 - 8kb        */
	{0x08152000,0x2000,41,2},        /* flash sector idx 41 - 8kb        */
	{0x08154000,0x2000,42,2},        /* flash sector idx 42 - 8kb        */
	{0x08156000,0x2000,43,2},        /* flash sector idx 43 - 8kb        */
	{0x08158000,0x2000,44,2},        /* flash sector idx 44 - 8kb        */
	{0x0815A000,0x2000,45,2},        /* flash sector idx 45 - 8kb        */
	{0x0815C000,0x2000,46,2},        /* flash sector idx 46 - 8kb        */
	{0x0815E000,0x2000,47,2},        /* flash sector idx 47 - 8kb        */
	{0x08160000,0x2000,48,2},        /* flash sector idx 48 - 8kb        */
	{0x08162000,0x2000,49,2},        /* flash sector idx 49 - 8kb        */
	{0x08164000,0x2000,50,2},        /* flash sector idx 50 - 8kb        */
	{0x08166000,0x2000,51,2},        /* flash sector idx 51 - 8kb        */
	{0x08168000,0x2000,52,2},        /* flash sector idx 52 - 8kb        */
	{0x0816A000,0x2000,53,2},        /* flash sector idx 53 - 8kb        */
	{0x0816C000,0x2000,54,2},        /* flash sector idx 54 - 8kb        */
	{0x0816E000,0x2000,55,2},        /* flash sector idx 55 - 8kb        */
	{0x08170000,0x2000,56,2},        /* flash sector idx 56 - 8kb        */
	{0x08172000,0x2000,57,2},        /* flash sector idx 57 - 8kb        */
	{0x08174000,0x2000,58,2},        /* flash sector idx 58 - 8kb        */
	{0x08176000,0x2000,59,2},        /* flash sector idx 59 - 8kb        */
	{0x08178000,0x2000,60,2},        /* flash sector idx 60 - 8kb        */
	{0x0817A000,0x2000,61,2},        /* flash sector idx 61 - 8kb        */
	{0x0817C000,0x2000,62,2},        /* flash sector idx 62 - 8kb        */
	{0x0817E000,0x2000,63,2},        /* flash sector idx 63 - 8kb        */
	{0x08180000,0x2000,64,2},        /* flash sector idx 64 - 8kb        */
	{0x08182000,0x2000,65,2},        /* flash sector idx 65 - 8kb        */
	{0x08184000,0x2000,66,2},        /* flash sector idx 66 - 8kb        */
	{0x08186000,0x2000,67,2},        /* flash sector idx 67 - 8kb        */
	{0x08188000,0x2000,68,2},        /* flash sector idx 68 - 8kb        */
	{0x0818A000,0x2000,69,2},        /* flash sector idx 69 - 8kb        */
	{0x0818C000,0x2000,70,2},        /* flash sector idx 70 - 8kb        */
	{0x0818E000,0x2000,71,2},        /* flash sector idx 71 - 8kb        */
	{0x08190000,0x2000,72,2},        /* flash sector idx 72 - 8kb        */
	{0x08192000,0x2000,73,2},        /* flash sector idx 73 - 8kb        */
	{0x08194000,0x2000,74,2},        /* flash sector idx 74 - 8kb        */
	{0x08196000,0x2000,75,2},        /* flash sector idx 75 - 8kb        */
	{0x08198000,0x2000,76,2},        /* flash sector idx 76 - 8kb        */
	{0x0819A000,0x2000,77,2},        /* flash sector idx 77 - 8kb        */
	{0x0819C000,0x2000,78,2},        /* flash sector idx 78 - 8kb        */
	{0x0819E000,0x2000,79,2},        /* flash sector idx 79 - 8kb        */
	{0x081A0000,0x2000,80,2},        /* flash sector idx 80 - 8kb        */
	{0x081A2000,0x2000,81,2},        /* flash sector idx 81 - 8kb        */
	{0x081A4000,0x2000,82,2},        /* flash sector idx 82 - 8kb        */
	{0x081A6000,0x2000,83,2},        /* flash sector idx 83 - 8kb        */
	{0x081A8000,0x2000,84,2},        /* flash sector idx 84 - 8kb        */
	{0x081AA000,0x2000,85,2},        /* flash sector idx 85 - 8kb        */
	{0x081AC000,0x2000,86,2},        /* flash sector idx 86 - 8kb        */
	{0x081AE000,0x2000,87,2},        /* flash sector idx 87 - 8kb        */
	{0x081B0000,0x2000,88,2},        /* flash sector idx 88 - 8kb        */
	{0x081B2000,0x2000,89,2},        /* flash sector idx 89 - 8kb        */
	{0x081B4000,0x2000,90,2},        /* flash sector idx 90 - 8kb        */
	{0x081B6000,0x2000,91,2},        /* flash sector idx 91 - 8kb        */
	{0x081B8000,0x2000,92,2},        /* flash sector idx 92 - 8kb        */
	{0x081BA000,0x2000,93,2},        /* flash sector idx 93 - 8kb        */
	{0x081BC000,0x2000,94,2},        /* flash sector idx 94 - 8kb        */
	{0x081BE000,0x2000,95,2},        /* flash sector idx 95 - 8kb        */
	{0x081C0000,0x2000,96,2},        /* flash sector idx 96 - 8kb        */
	{0x081C2000,0x2000,97,2},        /* flash sector idx 97 - 8kb        */
	{0x081C4000,0x2000,98,2},        /* flash sector idx 98 - 8kb        */
	{0x081C6000,0x2000,99,2},        /* flash sector idx 99 - 8kb        */
	{0x081C8000,0x2000,100,2},        /* flash sector idx 100 - 8kb        */
	{0x081CA000,0x2000,101,2},        /* flash sector idx 101 - 8kb        */
	{0x081CC000,0x2000,102,2},        /* flash sector idx 102 - 8kb        */
	{0x081CE000,0x2000,103,2},        /* flash sector idx 103 - 8kb        */
	{0x081D0000,0x2000,104,2},        /* flash sector idx 104 - 8kb        */
	{0x081D2000,0x2000,105,2},        /* flash sector idx 105 - 8kb        */
	{0x081D4000,0x2000,106,2},        /* flash sector idx 106 - 8kb        */
	{0x081D6000,0x2000,107,2},        /* flash sector idx 107 - 8kb        */
	{0x081D8000,0x2000,108,2},        /* flash sector idx 108 - 8kb        */
	{0x081DA000,0x2000,109,2},        /* flash sector idx 109 - 8kb        */
	{0x081DC000,0x2000,110,2},        /* flash sector idx 110 - 8kb        */
	{0x081DE000,0x2000,111,2},        /* flash sector idx 111 - 8kb        */
	{0x081E0000,0x2000,112,2},        /* flash sector idx 112 - 8kb        */
	{0x081E2000,0x2000,113,2},        /* flash sector idx 113 - 8kb        */
	{0x081E4000,0x2000,114,2},        /* flash sector idx 114 - 8kb        */
	{0x081E6000,0x2000,115,2},        /* flash sector idx 115 - 8kb        */
	{0x081E8000,0x2000,116,2},        /* flash sector idx 116 - 8kb        */
	{0x081EA000,0x2000,117,2},        /* flash sector idx 117 - 8kb        */
	{0x081EC000,0x2000,118,2},        /* flash sector idx 118 - 8kb        */
	{0x081EE000,0x2000,119,2},        /* flash sector idx 119 - 8kb        */
	{0x081F0000,0x2000,120,2},        /* flash sector idx 120 - 8kb        */
	{0x081F2000,0x2000,121,2},        /* flash sector idx 121 - 8kb        */
	{0x081F4000,0x2000,122,2},        /* flash sector idx 122 - 8kb        */
	{0x081F6000,0x2000,123,2},        /* flash sector idx 123 - 8kb        */
	{0x081F8000,0x2000,124,2},        /* flash sector idx 124 - 8kb        */
	{0x081FA000,0x2000,125,2},        /* flash sector idx 125 - 8kb        */
	{0x081FC000,0x2000,126,2},        /* flash sector idx 126 - 8kb        */
	{0x081FE000,0x2000,127,2},        /* flash sector idx 127 - 8kb        */

#else
 /* { 0x08000000, 0x20000, 0, 1 },     flash sector idx 0 - reserved for bootloader */
    { 0x08020000, 0x20000, 1, 1},        /* flash sector idx  1 - 128kb                */
    { 0x08040000, 0x20000, 2, 1},        /* flash sector idx  2 - 128kb                */
    { 0x08060000, 0x20000, 3, 1},        /* flash sector idx  3 - 128kb                */
    { 0x08080000, 0x20000, 4, 1},        /* flash sector idx  4 - 128kb                */
    { 0x080A0000, 0x20000, 5, 1},        /* flash sector idx  5 - 128kb                */
    { 0x080C0000, 0x20000, 6, 1},        /* flash sector idx  6 - 128kb                */
    { 0x080E0000, 0x20000, 7, 1},        /* flash sector idx  7 - 128kb                */
    { 0x08100000, 0x20000, 0, 2},        /* flash sector idx  8 - 128kb                */
    { 0x08120000, 0x20000, 1, 2},        /* flash sector idx  9 - 128kb                */
    { 0x08140000, 0x20000, 2, 2},        /* flash sector idx 10 - 128kb                */
    { 0x08160000, 0x20000, 3, 2},        /* flash sector idx 11 - 128kb                */
    { 0x08180000, 0x20000, 4, 2},        /* flash sector idx 12 - 128kb                */
    { 0x081A0000, 0x20000, 5, 2},        /* flash sector idx 13 - 128kb                */
    { 0x081C0000, 0x20000, 6, 2},        /* flash sector idx 14 - 128kb                */
    { 0x081E0000, 0x20000, 7, 2},        /* flash sector idx 15 - 128kb                */
#endif

#else
#error "BOOT_NVM_SIZE_KB > 2048 is currently not supported."
#endif
};
#else
#include "flash_layout.c"
#endif /* BOOT_FLASH_CUSTOM_LAYOUT_ENABLE == 0 */


